src/toir_cfe/src/DataProcessors/проф_ПечатьАктТехническогоСостоянияТС/проф_ПечатьАктТехническогоСостоянияТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>проф_ПечатьАктТехническогоСостоянияТС</name>
</mdclass:DataProcessor>

src/toir_cfe/src/AccumulationRegisters/торо_НаработкаОбъектовРемонта/торо_НаработкаОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0fb2df8c-9107-4695-8e88-6b53458d126c">
  <name>торо_НаработкаОбъектовРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="140c0589-4396-4fbd-aacc-7e0332bb4954">
    <name>Наработка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="f95e90a0-fbfa-4357-a315-5f5be5985494">
    <name>ДатаНач</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="08a971de-a5d1-48a0-901a-ac3249fa9ea3">
    <name>ДатаКон</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="905523e1-ecd0-4a06-ada5-ae31c7486a96">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="00273605-707e-4baf-9cba-4106f0447f06">
    <name>Показатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/Documents/торо_АктОВыполненииЭтапаРабот/торо_АктОВыполненииЭтапаРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b863b14e-c352-4234-8c63-d86d97f12044">
  <name>торо_АктОВыполненииЭтапаРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="6a750754-4a73-402d-8f35-6a379ec1cb60">
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="23087b8e-d21e-4499-beac-8287045096a2">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="35c6e5ea-774c-4081-b20e-6b7733152e33">
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f458fa39-e462-44c2-a688-fb165a2c6c8d">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="41c9c7b6-5db5-492f-8a78-0e1fb54a88c4">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Catalogs/торо_ОбъектыРемонта/торо_ОбъектыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bc7402bd-d283-40c7-9b61-dde80fafb3d8">
  <name>торо_ОбъектыРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="213a88d1-10cd-4415-be87-6466d619cd88">
    <name>ТиповойОР</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="47fb0293-feaf-4992-8644-4f79efbe139f">
    <name>Изготовитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0b0e085f-b80a-45ba-8729-f3d02e881457">
    <name>Направление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ea3c21ff-2af7-4916-a866-e5b01c2fea11">
    <name>ДатаВводаВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b5ba0323-3b01-46d2-9bde-8c0207e1cb21">
    <name>ДатаВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9f4d4241-b7f9-404c-96be-63c46d087525">
    <name>ШтрихКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="99b876ea-2a2a-4f0e-9d42-e4fb5ff631da">
    <name>ТипОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3a58cb8-2443-4009-b5f6-f4cb4f657cb7">
    <name>ИнвентарныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="db977b56-8d4f-477d-bacd-96c656f0c4e2">
    <name>ЗаводскойНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eebb6ad6-7b6c-4e39-8fe5-992da135c1dd">
    <name>ТехНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="5761f0bd-211f-4da4-82fc-476910d2db04">
    <name>проф_НормативныеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="757bfdf7-b0f2-4ce9-bf65-9a73743034b9">
    <name>проф_ПредшествующиеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="27d1aabe-5590-4b8a-92b6-17540e81adc7">
    <name>проф_ЗамещаемыеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="ee9e378e-a344-4a59-a2a5-054789005c8d">
    <name>проф_ТабличноеПолеРемонтныеЦиклыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f450d93a-cf39-4570-a8cc-896795681912">
    <name>проф_РемЦиклыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="e01b6f5d-fe35-434f-87a5-1ce36557d3e2">
    <name>проф_ТабЗапчастейОбъектовРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="0bdcaf87-2304-461b-9957-e534bec7fb10">
    <name>проф_ТабЗатратПоВидамРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c30740dc-2210-44f4-be97-a6f7b8e216b1">
    <name>проф_ГарантииОбъектаРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Catalog>

src/toir_cfe/src/DataProcessors/проф_ПечатьАктТехническогоСостоянияТС/ObjectModule.bsl
//++ Проф-ИТ, #129, Башинская А., 13.10.2023

#Область ПрограммныйИнтерфейс

Функция ПечатьАктТехническогоСостоянияТС(МассивОбъектов, ПараметрыПечати, ВидПечатнойФормы) Экспорт
	
	МассивРасширенийФалов = Новый Массив;
	МассивРасширенийФалов.Добавить("jpg");
	МассивРасширенийФалов.Добавить("jpeg");
	МассивРасширенийФалов.Добавить("png");
	МассивРасширенийФалов.Добавить("bmp");
	МассивРасширенийФалов.Добавить("gif");  
	МассивРасширенийФалов.Добавить("tiff");
	
	ТабДок = Новый ТабличныйДокумент;
	
	//++ Проф-ИТ, #129, Антонов Б.Л.,14.09.2023
	Если ВидПечатнойФормы = "проф_АктТехническогоСостоянияТС" Тогда
		Макет = ПолучитьМакет("проф_ПФ_MXL_АктТехническогоСостоянияТС");		
	ИначеЕсли ВидПечатнойФормы = "проф_АктТехническогоСостоянияДСТ" Тогда
		Макет = ПолучитьМакет("проф_ПФ_MXL_АктТехническогоСостоянияДСТ");
	Иначе
		Возврат ТабДок;
	КонецЕсли;
	//-- Проф-ИТ, #129, Антонов Б.Л.,14.09.2023

	ЗаголовокАкта   = Макет.ПолучитьОбласть("ШапкаДокумента");
	ДатаАкта        = Макет.ПолучитьОбласть("ДатаДокумента");
	//++ Проф-ИТ, #86, #129, Антонов Б.Л.,18.09.2023, Исправления
	ДанныеТС        = Макет.ПолучитьОбласть("ДанныеТС"); 
	Наработка       = Макет.ПолучитьОбласть("ДанныеТСНаработка");
	ДанныеТС2       = Макет.ПолучитьОбласть("ДанныеТС2");
	//-- Проф-ИТ, #86, #129, Антонов Б.Л.,18.09.2023, Исправления
	ОсновнаяТаблица = Макет.ПолучитьОбласть("ТабличнаяЧасть");
	ШапкаВИН        = Макет.ПолучитьОбласть("ШапкаФотоВИН");
	СтрокаВИН       = Макет.ПолучитьОбласть("СтрокаФотоВИН");
	ШапкаФото1      = Макет.ПолучитьОбласть("ШапкаФото1");
	СтрокаФото1     = Макет.ПолучитьОбласть("СтрокаФото1");
	ШапкаФото2      = Макет.ПолучитьОбласть("ШапкаФото2");
	СтрокаФото2     = Макет.ПолучитьОбласть("СтрокаФото2");
	ШапкаФото3      = Макет.ПолучитьОбласть("ШапкаФото3");
	СтрокаФото3     = Макет.ПолучитьОбласть("СтрокаФото3");
	ШапкаФото4      = Макет.ПолучитьОбласть("ШапкаФото4");
	СтрокаФото4     = Макет.ПолучитьОбласть("СтрокаФото4");
	ВтораяТаблица   = Макет.ПолучитьОбласть("ТабличнаяЧасть2");
	ШапкаКомиссия   = Макет.ПолучитьОбласть("ШапкаКомиссия");
	СтрокаКомиссия  = Макет.ПолучитьОбласть("СтрокаКомиссия");
	ПустаяСтрока    = Макет.ПолучитьОбласть("ПустаяСтрокаКомиссия");
	
	ПерваяСтраница = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаАктТехническогоСостоянияТС();		
	Запрос.УстановитьПараметр("МассивСсылка", МассивОбъектов);
	Запрос.УстановитьПараметр("МассивРасширений", МассивРасширенийФалов);

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаАкт = РезультатЗапроса[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "АктСсылка"); 
	
	Пока ВыборкаАкт.Следующий() Цикл 
		
		Если НЕ ПерваяСтраница Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПерваяСтраница = Ложь;
		КонецЕсли;
		//++ Проф-ИТ, #86, #129, Антонов Б.Л.,18.09.2023, Исправления
		ВыборкаОбъектРемонта = ВыборкаАкт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ОбъектВРемонте");	
		//-- Проф-ИТ, #86, #129, Антонов Б.Л.,18.09.2023, Исправления
		Пока ВыборкаОбъектРемонта.Следующий() Цикл
			
			Если НЕ ПерваяСтраница Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ЗаголовокАкта.Параметры.ИнвНомер = ВыборкаОбъектРемонта.ИнвентарныйНомер;
			ТабДок.Вывести(ЗаголовокАкта);
			
			ДатаАкта.Параметры.ДатаДокумента = Формат(ВыборкаАкт.Дата,"ДФ=dd.MM.yyyy");
			ТабДок.Вывести(ДатаАкта);
			
			ЗаполнитьЗначенияСвойств(ДанныеТС.Параметры, ВыборкаОбъектРемонта);
			
			ТабДок.Вывести(ДанныеТС);
			
			//++ Проф-ИТ, #86, #129, Антонов Б.Л.,18.09.2023, Исправления
			ВывестиСтрокуНаработка(ВыборкаОбъектРемонта, Наработка, ТабДок);
			
			ЗаполнитьЗначенияСвойств(ДанныеТС2.Параметры, ВыборкаОбъектРемонта);
			
			ТабДок.Вывести(ДанныеТС2);
			//-- Проф-ИТ, #86, #129, Антонов Б.Л.,18.09.2023, Исправления 
			
			ТабДок.Вывести(ОсновнаяТаблица);
			
			ПустаяКартинка = Новый Картинка();
			СтрокаВИН.Рисунки.ФотоВИН.Картинка = ПустаяКартинка; 
			
			СтрокаФото1.Рисунки.ФотоОбщийВид1.Картинка = ПустаяКартинка; 
			СтрокаФото2.Рисунки.ФотоОбщийВид2.Картинка = ПустаяКартинка; 
			СтрокаФото3.Рисунки.ФотоОбщийВид3.Картинка = ПустаяКартинка; 
			СтрокаФото4.Рисунки.ФотоОбщийВид4.Картинка = ПустаяКартинка; 
			
			ВыборкаВсеФайлыПоОбъекту = РезультатЗапроса[6].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ОбъектВРемонте");
			
			ВывестиВыборкуВсеФайлыПоОбъекту(ВыборкаВсеФайлыПоОбъекту, ВыборкаОбъектРемонта, СтрокаВИН,
												СтрокаФото1, СтрокаФото2, СтрокаФото3, СтрокаФото4);			 
			
			ТабДок.Вывести(ШапкаВИН);
			ТабДок.Вывести(СтрокаВИН);
			ТабДок.Вывести(ШапкаФото1);
			ТабДок.Вывести(СтрокаФото1);  
			ТабДок.Вывести(ШапкаФото2);
			ТабДок.Вывести(СтрокаФото2); 
			ТабДок.Вывести(ШапкаФото3);
			ТабДок.Вывести(СтрокаФото3); 
			ТабДок.Вывести(ШапкаФото4);
			ТабДок.Вывести(СтрокаФото4);
			
			ТабДок.Вывести(ВтораяТаблица);
			
			ТабДок.Вывести(ШапкаКомиссия); 
			
			ВыборкаКомиссия = РезультатЗапроса[4].Выбрать();
			
			ВывестиКомиссию(ВыборкаАкт, ВыборкаКомиссия, СтрокаКомиссия, ПустаяСтрока, ВидПечатнойФормы, ТабДок);
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТабДок;	
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Проф-ИТ, #86, #129, Антонов Б.Л.,18.09.2023, Исправления
Процедура ВывестиСтрокуНаработка(ВыборкаОбъектРемонта, Наработка, ТабДок)
	
	ВыборкаПоНаработке = ВыборкаОбъектРемонта.Выбрать(); 
	Пока ВыборкаПоНаработке.Следующий() Цикл 
		Наработка.Параметры.Наработка   = ВыборкаПоНаработке.Наработка;
		Наработка.Параметры.ЕдИзмерения = ВыборкаПоНаработке.ЕдИзмерения;
		ТабДок.Вывести(Наработка);
	КонецЦикла;
	
КонецПроцедуры
//-- Проф-ИТ, #86, #129, Антонов Б.Л.,18.09.2023, Исправления 

Процедура ВывестиВыборкуВсеФайлыПоОбъекту(ВыборкаВсеФайлыПоОбъекту, ВыборкаОбъектРемонта,
											СтрокаВин, СтрокаФото1, СтрокаФото2, СтрокаФото3, СтрокаФото4)
	
	Пока ВыборкаВсеФайлыПоОбъекту.Следующий() Цикл
		Если ВыборкаВсеФайлыПоОбъекту.ОбъектВРемонте <> ВыборкаОбъектРемонта.ОбъектВРемонте Тогда
			Продолжить;
		КонецЕсли;
		
		ВыборкаФайлыПоОбъекту = ВыборкаВсеФайлыПоОбъекту.Выбрать();  
		
		ВывестиВыборкуФайлыПоОбъекту(ВыборкаФайлыПоОбъекту, СтрокаВин, СтрокаФото1, СтрокаФото2, СтрокаФото3, СтрокаФото4); 	
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ВывестиВыборкуФайлыПоОбъекту(ВыборкаФайлыПоОбъекту, СтрокаВин,
											СтрокаФото1, СтрокаФото2, СтрокаФото3, СтрокаФото4)
											
	СчетчикФайлов = 1;
	Пока ВыборкаФайлыПоОбъекту.Следующий() Цикл
		ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(ВыборкаФайлыПоОбъекту.СсылкаФайла);
		Если ЗначениеЗаполнено(ДвоичныеДанные) Тогда
			КартинкаФото = Новый Картинка(ДвоичныеДанные);
		КонецЕсли; 
		Если СчетчикФайлов = 1 Тогда
			СтрокаВИН.Рисунки.ФотоВИН.Картинка = КартинкаФото;
		ИначеЕсли СчетчикФайлов = 2 Тогда 
			СтрокаФото1.Рисунки.ФотоОбщийВид1.Картинка = КартинкаФото;
		ИначеЕсли СчетчикФайлов = 3 Тогда 
			СтрокаФото2.Рисунки.ФотоОбщийВид2.Картинка = КартинкаФото;
		ИначеЕсли СчетчикФайлов = 4 Тогда 
			СтрокаФото3.Рисунки.ФотоОбщийВид3.Картинка = КартинкаФото;
		ИначеЕсли СчетчикФайлов = 5 Тогда 
			СтрокаФото4.Рисунки.ФотоОбщийВид4.Картинка = КартинкаФото;
		Иначе
			Продолжить;
		КонецЕсли;
		СчетчикФайлов = СчетчикФайлов + 1;
	КонецЦикла;  	
	
КонецПроцедуры	

Процедура ВывестиКомиссию(ВыборкаАкт, ВыборкаКомиссия, СтрокаКомиссия, ПустаяСтрока, ВидПечатнойФормы, ТабДок)
	
	Если НЕ ВыборкаАкт.Комиссия.Пустая() Тогда				
		Счетчик = 1;
		Пока ВыборкаКомиссия.Следующий() Цикл
			Если ВыборкаКомиссия.АктСсылка = ВыборкаАкт.АктСсылка Тогда
				СтрокаКомиссия.Параметры.НомерСтроки  = Счетчик;
				СтрокаКомиссия.Параметры.ЧленКомиссии = ВыборкаКомиссия.ЧленКомиссии;
				//++ Проф-ИТ, #129, Антонов Б.Л.,15.09.2023
				Если ВидПечатнойФормы = "проф_АктТехническогоСостоянияТС" Тогда
					СтрокаКомиссия.Параметры.Должность = ВыборкаКомиссия.ТекущаяДолжность;
				КонецЕсли;
				//++ Проф-ИТ, #129, Антонов Б.Л.,15.09.2023
				ТабДок.Вывести(СтрокаКомиссия);
				Счетчик = Счетчик + 1;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Счетчик = 1 По 4 Цикл
			ПустаяСтрока.Параметры.НомерСтроки  = Счетчик;
			ТабДок.Вывести(ПустаяСтрока);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры	

Функция ТекстЗапросаАктТехническогоСостоянияТС()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_АктОВыполненииЭтапаРабот.Ссылка КАК АктСсылка,
		|	торо_АктОВыполненииЭтапаРабот.Дата КАК Дата,
		|	торо_АктОВыполненииЭтапаРабот.Комиссия КАК Комиссия,
		|	ЕСТЬNULL(проф_МоделиТСиОборудования.ТипТС, """") КАК ТипТС,
		|	ЕСТЬNULL(торо_ОбъектыРемонта.проф_Марка, """") КАК проф_Марка,
		|	ЕСТЬNULL(торо_ОбъектыРемонта.проф_Модель, ЗНАЧЕНИЕ(Справочник.проф_МоделиТСиОборудования.ПустаяСсылка)) КАК проф_Модель,
		|	ЕСТЬNULL(торо_ОбъектыРемонта.проф_VIN, """") КАК проф_VIN,
		|	ЕСТЬNULL(ГОД(торо_ОбъектыРемонта.ДатаВыпуска), ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыпуска,
		|	ЕСТЬNULL(торо_ОбъектыРемонта.проф_Госномер, """") КАК проф_Госномер,
		|	ЕСТЬNULL(торо_ОбъектыРемонта.ИнвентарныйНомер, """") КАК ИнвентарныйНомер,
		|	ЕСТЬNULL(торо_ОбъектыРемонта.Ссылка, ЗНАЧЕНИЕ(Справочник.торо_ОбъектыРемонта.ПустаяСсылка)) КАК ОбъектВРемонте
		|ПОМЕСТИТЬ ВТ_ВРемонте
		|ИЗ
		|	Документ.торо_АктОВыполненииЭтапаРабот КАК торо_АктОВыполненииЭтапаРабот
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.проф_МоделиТСиОборудования КАК проф_МоделиТСиОборудования
		|				ПО торо_ОбъектыРемонта.проф_Модель = проф_МоделиТСиОборудования.Ссылка
		|			ПО торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
		|		ПО торо_АктОВыполненииЭтапаРабот.Ссылка = торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка
		|ГДЕ
		|	торо_АктОВыполненииЭтапаРабот.Ссылка В(&МассивСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ВРемонте.ОбъектВРемонте КАК ОбъектВРемонте,
		|	МАКСИМУМ(проф_МестонахождениеТС.Дата) КАК Дата,
		|	МАКСИМУМ(проф_МестонахождениеТС.Подразделение) КАК Подразделение,
		|	ВТ_ВРемонте.АктСсылка КАК АктСсылка
		|ПОМЕСТИТЬ ВТ_Местонахождение
		|ИЗ
		|	ВТ_ВРемонте КАК ВТ_ВРемонте
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.проф_МестонахождениеТС КАК проф_МестонахождениеТС
		|		ПО ВТ_ВРемонте.ОбъектВРемонте = проф_МестонахождениеТС.ОбъектРемонта
		|ГДЕ
		|	проф_МестонахождениеТС.Дата <= ВТ_ВРемонте.Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВРемонте.АктСсылка,
		|	ВТ_ВРемонте.ОбъектВРемонте
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_НаработкаОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
		//++ Проф-ИТ, #86, #129, Антонов Б.Л.,19.09.2023, Исправления
		|	ЕСТЬNULL(торо_НаработкаОбъектовРемонта.Наработка, 0) КАК Наработка,
		//-- Проф-ИТ, #86, #129, Антонов Б.Л.,19.09.2023, Исправления
		|	ВТ_ВРемонте.АктСсылка КАК АктСсылка,
		|	ЕСТЬNULL(ЕдиницыИзмерения.Ссылка, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
		//++ Проф-ИТ, #86, #129, Антонов Б.Л.,20.09.2023, Исправления
		|	торо_НаработкаОбъектовРемонта.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТ_НаработкаПоРегистратору
		//-- Проф-ИТ, #86, #129, Антонов Б.Л.,20.09.2023, Исправления
		|ИЗ
		|	ВТ_ВРемонте КАК ВТ_ВРемонте
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_НаработкаОбъектовРемонта КАК торо_НаработкаОбъектовРемонта
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПараметрыВыработкиОС КАК ПараметрыВыработкиОС
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|				ПО ПараметрыВыработкиОС.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
		|			ПО торо_НаработкаОбъектовРемонта.Показатель = ПараметрыВыработкиОС.Ссылка
		|		ПО ВТ_ВРемонте.ОбъектВРемонте = торо_НаработкаОбъектовРемонта.ОбъектРемонта
		|ГДЕ
		|	торо_НаработкаОбъектовРемонта.Период <= ВТ_ВРемонте.Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_НаработкаОбъектовРемонта.ОбъектРемонта,
		|	ВТ_ВРемонте.АктСсылка,
		|	ЕСТЬNULL(ЕдиницыИзмерения.Ссылка, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)),  
		//++ Проф-ИТ, #86, #129, Антонов Б.Л.,19.09.2023, Исправления
		|	ЕСТЬNULL(торо_НаработкаОбъектовРемонта.Наработка, 0),
		//-- Проф-ИТ, #86, #129, Антонов Б.Л.,19.09.2023, Исправления
		//++ Проф-ИТ, #86, #129, Антонов Б.Л.,20.09.2023, Исправления
		|	торо_НаработкаОбъектовРемонта.Регистратор  
		//++ Проф-ИТ, #86, #129, Антонов Б.Л.,20.09.2023, Исправления
		|;
		|
		//++ Проф-ИТ, #86, #129, Антонов Б.Л.,20.09.2023, Исправления
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_НаработкаПоРегистратору.ОбъектРемонта КАК ОбъектРемонта,
		|	СУММА(ЕСТЬNULL(ВТ_НаработкаПоРегистратору.Наработка, 0)) КАК Наработка,
		|	ЕСТЬNULL(ВТ_НаработкаПоРегистратору.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
		|	ВТ_НаработкаПоРегистратору.АктСсылка КАК АктСсылка
		|ПОМЕСТИТЬ ВТ_Наработка
		|ИЗ
		|	ВТ_НаработкаПоРегистратору КАК ВТ_НаработкаПоРегистратору
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_НаработкаПоРегистратору.ОбъектРемонта,
		|	ВТ_НаработкаПоРегистратору.АктСсылка,
		|	ЕСТЬNULL(ВТ_НаработкаПоРегистратору.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))
		|;
		|
		//-- Проф-ИТ, #86, #129, Антонов Б.Л.,20.09.2023, Исправления
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ФизическиеЛица.Ссылка, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК ЧленКомиссии,
		|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.ТекущаяДолжность, ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)) КАК ТекущаяДолжность,
		|	ВТ_ВРемонте.АктСсылка КАК АктСсылка
		|ИЗ
		|	ВТ_ВРемонте КАК ВТ_ВРемонте
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_Комиссии.СоставКомиссии КАК торо_КомиссииСоставКомиссии
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|					ПО ФизическиеЛица.Ссылка = ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо
		|				ПО Сотрудники.ФизическоеЛицо = ФизическиеЛица.Ссылка
		|			ПО торо_КомиссииСоставКомиссии.ЧленКомиссии = Сотрудники.Ссылка
		|		ПО ВТ_ВРемонте.Комиссия = торо_КомиссииСоставКомиссии.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВРемонте.АктСсылка,
		|	ЕСТЬNULL(ФизическиеЛица.Ссылка, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)),
		|	ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.ТекущаяДолжность, ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ВТ_Наработка.Наработка, 0) КАК Наработка,
		|	ВТ_ВРемонте.ТипТС КАК ТипТС,
		|	ВТ_ВРемонте.проф_Марка КАК МаркаТС,
		|	ВТ_ВРемонте.проф_Модель КАК МодельТС,
		|	ВТ_ВРемонте.проф_VIN КАК VIN,
		|	ВТ_ВРемонте.ДатаВыпуска КАК ДатаВыпуска,
		|	ВТ_ВРемонте.проф_Госномер КАК ГосНомер,
		|	ЕСТЬNULL(ВТ_Местонахождение.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Местонахождение,
		|	ВТ_ВРемонте.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ВТ_ВРемонте.АктСсылка КАК АктСсылка,
		|	ВТ_ВРемонте.Комиссия КАК Комиссия,
		|	ВТ_ВРемонте.Дата КАК Дата,
		|	ВТ_ВРемонте.ОбъектВРемонте КАК ОбъектВРемонте,
		|	ЕСТЬNULL(ВТ_Наработка.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)) КАК ЕдИзмерения
		|ИЗ
		|	ВТ_ВРемонте КАК ВТ_ВРемонте
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Наработка КАК ВТ_Наработка
		|		ПО ВТ_ВРемонте.АктСсылка = ВТ_Наработка.АктСсылка
		|			И ВТ_ВРемонте.ОбъектВРемонте = ВТ_Наработка.ОбъектРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Местонахождение КАК ВТ_Местонахождение
		|		ПО ВТ_ВРемонте.АктСсылка = ВТ_Местонахождение.АктСсылка
		|			И ВТ_ВРемонте.ОбъектВРемонте = ВТ_Местонахождение.ОбъектВРемонте 
		//++ Проф-ИТ, #86, #129, Антонов Б.Л.,19.09.2023, Исправления
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВРемонте.ИнвентарныйНомер,
		|	ЕСТЬNULL(ВТ_Наработка.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)),
		|	ВТ_ВРемонте.АктСсылка,
		|	ВТ_ВРемонте.ОбъектВРемонте,
		|	ВТ_ВРемонте.Дата,
		|	ВТ_ВРемонте.Комиссия,
		|	ЕСТЬNULL(ВТ_Местонахождение.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)),
		|	ВТ_ВРемонте.проф_Госномер,
		|	ВТ_ВРемонте.проф_VIN,
		|	ВТ_ВРемонте.проф_Модель,
		|	ВТ_ВРемонте.ТипТС,
		|	ВТ_ВРемонте.проф_Марка,
		|	ЕСТЬNULL(ВТ_Наработка.Наработка, 0),
		|	ВТ_ВРемонте.ДатаВыпуска
		//-- Проф-ИТ, #86, #129, Антонов Б.Л.,19.09.2023, Исправления
		|ИТОГИ
		//++ Проф-ИТ, #86, #129, Антонов Б.Л.,18.09.2023, Исправления
		|	МАКСИМУМ(ТипТС),
		|	МАКСИМУМ(МаркаТС),
		|	МАКСИМУМ(МодельТС),
		|	МАКСИМУМ(VIN),
		|	МАКСИМУМ(ДатаВыпуска),
		|	МАКСИМУМ(ГосНомер),
		|	МАКСИМУМ(Местонахождение),
		|	МАКСИМУМ(ИнвентарныйНомер),
		|	МАКСИМУМ(Комиссия),
		|	МАКСИМУМ(Дата)
		|ПО
		|	АктСсылка,
		|	ОбъектВРемонте
		|;
		//-- Проф-ИТ, #86, #129, Антонов Б.Л.,18.09.2023, Исправления
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ОбъектыРемонтаПрисоединенныеФайлы.Ссылка КАК СсылкаФайла,
		|	ВТ_ВРемонте.АктСсылка КАК АктСсылка,
		|	ВТ_ВРемонте.ОбъектВРемонте КАК ОбъектВРемонте
		|ИЗ
		|	Справочник.торо_ОбъектыРемонтаПрисоединенныеФайлы КАК торо_ОбъектыРемонтаПрисоединенныеФайлы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВРемонте КАК ВТ_ВРемонте
		|		ПО торо_ОбъектыРемонтаПрисоединенныеФайлы.ВладелецФайла = ВТ_ВРемонте.ОбъектВРемонте
		|ГДЕ
		|	торо_ОбъектыРемонтаПрисоединенныеФайлы.Расширение В(&МассивРасширений)
		|ИТОГИ ПО
		|	ОбъектВРемонте";
	
	Возврат ТекстЗапроса;
	
КонецФункции	

#КонецОбласти

//-- Проф-ИТ, #129, Башинская А., 13.10.2023
